
<template>
    <el-row type="flex" class="faq-bg" justify="center" :gutter="20">
        <el-col :xs="24" :sm="24" :md="18" :lg="18">
            <h2>Вопросы про ICO и pre-ICO</h2>
            <el-collapse>
                <el-collapse-item v-for="question in questions" :key="question.id">
                    <template slot="title">
                        <span class="faq-header">{{question.title}}</span>
                    </template>
                    <div class="faq-body">{{question.body}}</div>
                </el-collapse-item>
            </el-collapse>
        </el-col>
    </el-row>
</template>

<script>
export default {
    data () {
        return {
            questions: [
                {
                    title: 'Что такое токены Mapala?',
                    body: 'Mapala.net является децентрализованной “народной” компанией. Токены являются аналогом акций и определяют долю вашего владения компанией. В дальнейшем владельцам токенов будет начисляться часть прибыли компании.'
                },
                {
                    title: 'Каким образом будут начисляться “акции”?',
                    body: 'На сегодняшний день “акции” начисляются участникам pre-ICO. С подробностями можно ознакомится здесь: http://mapala.net/mapala/anons-pre-ico-mapalanet. “Акции” начисляются также участникам баунти (авторам первых 1000 постов): http://mapala.net/mapala/pervoe-baunti-mapalanet---kazhdomu-avtoru-po-200-tokenov-za-statxyu'
                },
                {
                    title: 'Как продать токены mapala.net? На каких биржах они торгуются?',
                    body: 'Пока ни на каких — проект находится в альфа-версии. Токены появятся на бирже после проведения полноценного ICO (ориентировочно осенью 2017 года).'
                },
                {
                    title: 'Что вообще такое ICO?',
                    body: 'ICO (Initial Coin Offerings — первичное размещение монет) — формат криптовалютного краудфандинга. Это один из самых простых и эффективных методов для компаний по привлечению средств в форме криптоакций. ICO предоставляет инвесторам приобрести монеты, которые обращаются в самой бизнес-модели и будут расти в стоимости при развитии и масштабировании проекта.'
                },
                {
                    title: 'Что такое pre-ICO в mapala.net, и чем оно отличается от ICO?',
                    body: 'Сейчас у Mapala.net есть работающая и далеко не идеальная alfa-версия сайта, ориентированная на наполнение туристической базы знаний. Сейчас ведётся разработка бета-версии, которая будет выполнена на более высоком техническом уровне, соответствуя мировым стандартам качества. Для финансирования и разработки бета-версии mapala.net проводится pre-ICO. После выхода бета-версии сайта и этапа тестирования, мы проведём полноценное ICO, и собранные средства будут использованы для продолжения разработок и масштабного продвижения по миру.'
                },
                {
                    title: 'Как мне принять участие в ICO?',
                    body: 'На данный момент можно принять участие в pre-ICO. Инструкция здесь: https://golos.io/mapala/@mapala/instrukcziya-po-uchastiyu-v-pre-ico-mapalanet'
                },
                {
                    title: 'Как долго продлится ICO в Mapala.net?',
                    body: 'Pre-ICO продлится до завершения разработки бета-версии проекта (около 7 месяцев) или до сбора 450 тысяч в долларовом эквиваленте. Этап ICO продлится 1 месяц. 10. За что и почему выделяются бонусы в pre-ICO? Мы запланировали плавный запуск и будем постепенно задействовать всё больший информационный охват с каждой неделей. Поэтому ожидаем всплеск активности каждую неделю во время всего периода проведения pre-ICO. Самых быстрых из вновь узнавших и пожелавших принять участие в pre-ICO, мы вознаграждаем бонусом, который уменьшается с каждым новым днём недели:'
                },
                {
                    title: 'Где будут хранится мои “акции”?',
                    body: 'Ваши акции хранятся и отображаются в личном кабинете на Mapala.net. Мы принимаем в качестве “инвестиций” только криптовалюты: BTC, GBG, SBD. Это позволяет нам быть полностью прозрачными, потому что все транзакции могут быть проверены любым участником.'
                },
                {
                    title: 'Почему принимается только три криптовалюты?',
                    body: 'Мы принимаем биткоины как самую ликвидную криптовалюту. Мы принимаем GBG и SBD, потому что работаем в экономической системе (на блокчейнах) Steem и Голос.'
                },
                {
                    title: 'Сколько я получу токенов за 1 GBG/BTC?',
                    body: 'Каждую неделю мы “выпускаем” 810 тыс. “акций”, которые распределяются между всеми “инвесторами”, принявшими участие в финансировании проекта. Распределение токенов происходит в соответствии с долей участия каждого “инвестора” на этой неделе. Новая неделя — новое распределение 810 тыс. токенов среди “инвесторов” этой недели.'
                },
                {
                    title: 'Могу ли я вернуть средства или продать “акции”?',
                    body: '“Акции” можно будет продать, когда компания выйдет на криптовалютную биржу (ориентировочно осенью 2017 года). По любым вопросам обращайтесь в чат в Telegram (https://t.me/mapala_ru) или к Консультанту на сайте Mapala.net.'
                }
            ]
        }
    }
}
</script>

<style scoped>
.faq-bg h2 {
    text-align: center;
}
.el-collapse {
    border: 0;
}
.el-collapse-item__wrap {
    background-color: #ffffff
}
.faq-header {
    color: #00a3e5;
    font-size: 20px;
}
.el-collapse-item{
    margin-top: 25px;
    margin-bottom: 28px;
}
.faq-body {
    border-left: solid 2.2px #d1d1d1;
    padding-left: 14px;
}
</style>